{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "pad_r" : 2,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_0",
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "164",
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "Conv_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 2,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "input",
      "weights" : {

      },
      "Nx" : 6,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 6,
      "n_parallel" : 1,
      "blob_weights_f16" : 3
    },
    {
      "bottom" : "164",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_1",
      "top" : "165",
      "type" : "activation",
      "name" : "Sigmoid_1"
    },
    {
      "bottom" : "164,165",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_2",
      "top" : "166",
      "type" : "elementwise",
      "name" : "Mul_2",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_3",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "167",
      "K" : 16,
      "blob_biases" : 5,
      "stride_x" : 2,
      "name" : "Conv_3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "166",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 7
    },
    {
      "bottom" : "167",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_4",
      "top" : "168",
      "type" : "activation",
      "name" : "Sigmoid_4"
    },
    {
      "bottom" : "167,168",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_5",
      "top" : "169",
      "type" : "elementwise",
      "name" : "Mul_5",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_6",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "170",
      "K" : 32,
      "blob_biases" : 9,
      "name" : "Conv_6",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "169",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 11
    },
    {
      "bottom" : "170",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_7",
      "top" : "171",
      "type" : "activation",
      "name" : "Sigmoid_7"
    },
    {
      "bottom" : "170,171",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_8",
      "top" : "172",
      "type" : "elementwise",
      "name" : "Mul_8",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_9",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "173",
      "K" : 16,
      "blob_biases" : 13,
      "name" : "Conv_9",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "172",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 15
    },
    {
      "bottom" : "173",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_10",
      "top" : "174",
      "type" : "activation",
      "name" : "Sigmoid_10"
    },
    {
      "bottom" : "173,174",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_11",
      "top" : "175",
      "type" : "elementwise",
      "name" : "Mul_11",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_12",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "176",
      "K" : 32,
      "blob_biases" : 17,
      "name" : "Conv_12",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "175",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 19
    },
    {
      "bottom" : "176",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_13",
      "top" : "177",
      "type" : "activation",
      "name" : "Sigmoid_13"
    },
    {
      "bottom" : "176,177",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_14",
      "top" : "178",
      "type" : "elementwise",
      "name" : "Mul_14",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_15",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "179",
      "K" : 32,
      "blob_biases" : 21,
      "name" : "Conv_15",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "178",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 23
    },
    {
      "bottom" : "179",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_16",
      "top" : "180",
      "type" : "activation",
      "name" : "Sigmoid_16"
    },
    {
      "bottom" : "179,180",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_17",
      "top" : "181",
      "type" : "elementwise",
      "name" : "Mul_17",
      "beta" : 0
    },
    {
      "bottom" : "172,181",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Add_18",
      "top" : "182",
      "type" : "elementwise",
      "name" : "Add_18",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_19",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "183",
      "K" : 32,
      "blob_biases" : 25,
      "name" : "Conv_19",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "169",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 27
    },
    {
      "bottom" : "183",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_20",
      "top" : "184",
      "type" : "activation",
      "name" : "Sigmoid_20"
    },
    {
      "bottom" : "183,184",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_21",
      "top" : "185",
      "type" : "elementwise",
      "name" : "Mul_21",
      "beta" : 0
    },
    {
      "weights" : {

      },
      "debug_info" : "Concat_22",
      "top" : "186",
      "type" : "concat",
      "name" : "Concat_22",
      "bottom" : "182,185"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_23",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "187",
      "K" : 32,
      "blob_biases" : 29,
      "name" : "Conv_23",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "186",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 31
    },
    {
      "bottom" : "187",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_24",
      "top" : "188",
      "type" : "activation",
      "name" : "Sigmoid_24"
    },
    {
      "bottom" : "187,188",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_25",
      "top" : "189",
      "type" : "elementwise",
      "name" : "Mul_25",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_26",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "190",
      "K" : 32,
      "blob_biases" : 33,
      "name" : "Conv_26",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "189",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 35
    },
    {
      "bottom" : "190",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_27",
      "top" : "191",
      "type" : "activation",
      "name" : "Sigmoid_27"
    },
    {
      "bottom" : "190,191",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_28",
      "top" : "192",
      "type" : "elementwise",
      "name" : "Mul_28",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_29",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "193",
      "K" : 64,
      "blob_biases" : 37,
      "stride_x" : 2,
      "name" : "Conv_29",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "192",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 39
    },
    {
      "bottom" : "193",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_30",
      "top" : "194",
      "type" : "activation",
      "name" : "Sigmoid_30"
    },
    {
      "bottom" : "193,194",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_31",
      "top" : "195",
      "type" : "elementwise",
      "name" : "Mul_31",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_32",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "196",
      "K" : 64,
      "blob_biases" : 41,
      "name" : "Conv_32",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "195",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 43
    },
    {
      "bottom" : "196",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_33",
      "top" : "197",
      "type" : "activation",
      "name" : "Sigmoid_33"
    },
    {
      "bottom" : "196,197",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_34",
      "top" : "198",
      "type" : "elementwise",
      "name" : "Mul_34",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_35",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "199",
      "K" : 64,
      "blob_biases" : 45,
      "name" : "Conv_35",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "198",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 47
    },
    {
      "bottom" : "199",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_36",
      "top" : "200",
      "type" : "activation",
      "name" : "Sigmoid_36"
    },
    {
      "bottom" : "199,200",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_37",
      "top" : "201",
      "type" : "elementwise",
      "name" : "Mul_37",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_38",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "202",
      "K" : 32,
      "blob_biases" : 49,
      "name" : "Conv_38",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "201",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 51
    },
    {
      "bottom" : "202",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_39",
      "top" : "203",
      "type" : "activation",
      "name" : "Sigmoid_39"
    },
    {
      "bottom" : "202,203",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_40",
      "top" : "204",
      "type" : "elementwise",
      "name" : "Mul_40",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_41",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "205",
      "K" : 64,
      "blob_biases" : 53,
      "name" : "Conv_41",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "204",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 55
    },
    {
      "bottom" : "205",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_42",
      "top" : "206",
      "type" : "activation",
      "name" : "Sigmoid_42"
    },
    {
      "bottom" : "205,206",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_43",
      "top" : "207",
      "type" : "elementwise",
      "name" : "Mul_43",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_44",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "208",
      "K" : 64,
      "blob_biases" : 57,
      "name" : "Conv_44",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "207",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 59
    },
    {
      "bottom" : "208",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_45",
      "top" : "209",
      "type" : "activation",
      "name" : "Sigmoid_45"
    },
    {
      "bottom" : "208,209",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_46",
      "top" : "210",
      "type" : "elementwise",
      "name" : "Mul_46",
      "beta" : 0
    },
    {
      "bottom" : "201,210",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Add_47",
      "top" : "211",
      "type" : "elementwise",
      "name" : "Add_47",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_48",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "212",
      "K" : 32,
      "blob_biases" : 61,
      "name" : "Conv_48",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "211",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 63
    },
    {
      "bottom" : "212",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_49",
      "top" : "213",
      "type" : "activation",
      "name" : "Sigmoid_49"
    },
    {
      "bottom" : "212,213",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_50",
      "top" : "214",
      "type" : "elementwise",
      "name" : "Mul_50",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_51",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "215",
      "K" : 64,
      "blob_biases" : 65,
      "name" : "Conv_51",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "214",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 67
    },
    {
      "bottom" : "215",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_52",
      "top" : "216",
      "type" : "activation",
      "name" : "Sigmoid_52"
    },
    {
      "bottom" : "215,216",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_53",
      "top" : "217",
      "type" : "elementwise",
      "name" : "Mul_53",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_54",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "218",
      "K" : 64,
      "blob_biases" : 69,
      "name" : "Conv_54",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "217",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 71
    },
    {
      "bottom" : "218",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_55",
      "top" : "219",
      "type" : "activation",
      "name" : "Sigmoid_55"
    },
    {
      "bottom" : "218,219",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_56",
      "top" : "220",
      "type" : "elementwise",
      "name" : "Mul_56",
      "beta" : 0
    },
    {
      "bottom" : "211,220",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Add_57",
      "top" : "221",
      "type" : "elementwise",
      "name" : "Add_57",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_58",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "222",
      "K" : 64,
      "blob_biases" : 73,
      "name" : "Conv_58",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "198",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 75
    },
    {
      "bottom" : "222",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_59",
      "top" : "223",
      "type" : "activation",
      "name" : "Sigmoid_59"
    },
    {
      "bottom" : "222,223",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_60",
      "top" : "224",
      "type" : "elementwise",
      "name" : "Mul_60",
      "beta" : 0
    },
    {
      "weights" : {

      },
      "debug_info" : "Concat_61",
      "top" : "225",
      "type" : "concat",
      "name" : "Concat_61",
      "bottom" : "221,224"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_62",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "226",
      "K" : 64,
      "blob_biases" : 77,
      "name" : "Conv_62",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "225",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 79
    },
    {
      "bottom" : "226",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_63",
      "top" : "227",
      "type" : "activation",
      "name" : "Sigmoid_63"
    },
    {
      "bottom" : "226,227",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_64",
      "top" : "228",
      "type" : "elementwise",
      "name" : "Mul_64",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_65",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "229",
      "K" : 64,
      "blob_biases" : 81,
      "name" : "Conv_65",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "228",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 83
    },
    {
      "bottom" : "229",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_66",
      "top" : "230",
      "type" : "activation",
      "name" : "Sigmoid_66"
    },
    {
      "bottom" : "229,230",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_67",
      "top" : "231",
      "type" : "elementwise",
      "name" : "Mul_67",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_68",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "232",
      "K" : 128,
      "blob_biases" : 85,
      "stride_x" : 2,
      "name" : "Conv_68",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "231",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 87
    },
    {
      "bottom" : "232",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_69",
      "top" : "233",
      "type" : "activation",
      "name" : "Sigmoid_69"
    },
    {
      "bottom" : "232,233",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_70",
      "top" : "234",
      "type" : "elementwise",
      "name" : "Mul_70",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_71",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "235",
      "K" : 128,
      "blob_biases" : 89,
      "name" : "Conv_71",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "234",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 91
    },
    {
      "bottom" : "235",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_72",
      "top" : "236",
      "type" : "activation",
      "name" : "Sigmoid_72"
    },
    {
      "bottom" : "235,236",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_73",
      "top" : "237",
      "type" : "elementwise",
      "name" : "Mul_73",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_74",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "238",
      "K" : 128,
      "blob_biases" : 93,
      "name" : "Conv_74",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "237",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 95
    },
    {
      "bottom" : "238",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_75",
      "top" : "239",
      "type" : "activation",
      "name" : "Sigmoid_75"
    },
    {
      "bottom" : "238,239",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_76",
      "top" : "240",
      "type" : "elementwise",
      "name" : "Mul_76",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_77",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "241",
      "K" : 64,
      "blob_biases" : 97,
      "name" : "Conv_77",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "240",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 99
    },
    {
      "bottom" : "241",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_78",
      "top" : "242",
      "type" : "activation",
      "name" : "Sigmoid_78"
    },
    {
      "bottom" : "241,242",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_79",
      "top" : "243",
      "type" : "elementwise",
      "name" : "Mul_79",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_80",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "244",
      "K" : 128,
      "blob_biases" : 101,
      "name" : "Conv_80",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "243",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 103
    },
    {
      "bottom" : "244",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_81",
      "top" : "245",
      "type" : "activation",
      "name" : "Sigmoid_81"
    },
    {
      "bottom" : "244,245",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_82",
      "top" : "246",
      "type" : "elementwise",
      "name" : "Mul_82",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_83",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "247",
      "K" : 128,
      "blob_biases" : 105,
      "name" : "Conv_83",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "246",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 107
    },
    {
      "bottom" : "247",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_84",
      "top" : "248",
      "type" : "activation",
      "name" : "Sigmoid_84"
    },
    {
      "bottom" : "247,248",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_85",
      "top" : "249",
      "type" : "elementwise",
      "name" : "Mul_85",
      "beta" : 0
    },
    {
      "bottom" : "240,249",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Add_86",
      "top" : "250",
      "type" : "elementwise",
      "name" : "Add_86",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_87",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "251",
      "K" : 64,
      "blob_biases" : 109,
      "name" : "Conv_87",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "250",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 111
    },
    {
      "bottom" : "251",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_88",
      "top" : "252",
      "type" : "activation",
      "name" : "Sigmoid_88"
    },
    {
      "bottom" : "251,252",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_89",
      "top" : "253",
      "type" : "elementwise",
      "name" : "Mul_89",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_90",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "254",
      "K" : 128,
      "blob_biases" : 113,
      "name" : "Conv_90",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "253",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 115
    },
    {
      "bottom" : "254",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_91",
      "top" : "255",
      "type" : "activation",
      "name" : "Sigmoid_91"
    },
    {
      "bottom" : "254,255",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_92",
      "top" : "256",
      "type" : "elementwise",
      "name" : "Mul_92",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_93",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "257",
      "K" : 128,
      "blob_biases" : 117,
      "name" : "Conv_93",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "256",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 119
    },
    {
      "bottom" : "257",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_94",
      "top" : "258",
      "type" : "activation",
      "name" : "Sigmoid_94"
    },
    {
      "bottom" : "257,258",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_95",
      "top" : "259",
      "type" : "elementwise",
      "name" : "Mul_95",
      "beta" : 0
    },
    {
      "bottom" : "250,259",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Add_96",
      "top" : "260",
      "type" : "elementwise",
      "name" : "Add_96",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_97",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "261",
      "K" : 64,
      "blob_biases" : 121,
      "name" : "Conv_97",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "260",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 123
    },
    {
      "bottom" : "261",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_98",
      "top" : "262",
      "type" : "activation",
      "name" : "Sigmoid_98"
    },
    {
      "bottom" : "261,262",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_99",
      "top" : "263",
      "type" : "elementwise",
      "name" : "Mul_99",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_100",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "264",
      "K" : 128,
      "blob_biases" : 125,
      "name" : "Conv_100",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "263",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 127
    },
    {
      "bottom" : "264",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_101",
      "top" : "265",
      "type" : "activation",
      "name" : "Sigmoid_101"
    },
    {
      "bottom" : "264,265",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_102",
      "top" : "266",
      "type" : "elementwise",
      "name" : "Mul_102",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_103",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "267",
      "K" : 128,
      "blob_biases" : 129,
      "name" : "Conv_103",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "266",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 131
    },
    {
      "bottom" : "267",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_104",
      "top" : "268",
      "type" : "activation",
      "name" : "Sigmoid_104"
    },
    {
      "bottom" : "267,268",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_105",
      "top" : "269",
      "type" : "elementwise",
      "name" : "Mul_105",
      "beta" : 0
    },
    {
      "bottom" : "260,269",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Add_106",
      "top" : "270",
      "type" : "elementwise",
      "name" : "Add_106",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_107",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "271",
      "K" : 128,
      "blob_biases" : 133,
      "name" : "Conv_107",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "237",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 135
    },
    {
      "bottom" : "271",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_108",
      "top" : "272",
      "type" : "activation",
      "name" : "Sigmoid_108"
    },
    {
      "bottom" : "271,272",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_109",
      "top" : "273",
      "type" : "elementwise",
      "name" : "Mul_109",
      "beta" : 0
    },
    {
      "weights" : {

      },
      "debug_info" : "Concat_110",
      "top" : "274",
      "type" : "concat",
      "name" : "Concat_110",
      "bottom" : "270,273"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_111",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "275",
      "K" : 128,
      "blob_biases" : 137,
      "name" : "Conv_111",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "274",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 139
    },
    {
      "bottom" : "275",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_112",
      "top" : "276",
      "type" : "activation",
      "name" : "Sigmoid_112"
    },
    {
      "bottom" : "275,276",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_113",
      "top" : "277",
      "type" : "elementwise",
      "name" : "Mul_113",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_114",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "278",
      "K" : 128,
      "blob_biases" : 141,
      "name" : "Conv_114",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "277",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 143
    },
    {
      "bottom" : "278",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_115",
      "top" : "279",
      "type" : "activation",
      "name" : "Sigmoid_115"
    },
    {
      "bottom" : "278,279",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_116",
      "top" : "280",
      "type" : "elementwise",
      "name" : "Mul_116",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_117",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "281",
      "K" : 256,
      "blob_biases" : 145,
      "stride_x" : 2,
      "name" : "Conv_117",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "280",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 147
    },
    {
      "bottom" : "281",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_118",
      "top" : "282",
      "type" : "activation",
      "name" : "Sigmoid_118"
    },
    {
      "bottom" : "281,282",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_119",
      "top" : "283",
      "type" : "elementwise",
      "name" : "Mul_119",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_120",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "284",
      "K" : 256,
      "blob_biases" : 149,
      "name" : "Conv_120",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "283",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 151
    },
    {
      "bottom" : "284",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_121",
      "top" : "285",
      "type" : "activation",
      "name" : "Sigmoid_121"
    },
    {
      "bottom" : "284,285",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_122",
      "top" : "286",
      "type" : "elementwise",
      "name" : "Mul_122",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_123",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "287",
      "K" : 256,
      "blob_biases" : 153,
      "name" : "Conv_123",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "286",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 155
    },
    {
      "bottom" : "287",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_124",
      "top" : "288",
      "type" : "activation",
      "name" : "Sigmoid_124"
    },
    {
      "bottom" : "287,288",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_125",
      "top" : "289",
      "type" : "elementwise",
      "name" : "Mul_125",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_126",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "290",
      "K" : 128,
      "blob_biases" : 157,
      "name" : "Conv_126",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "289",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 159
    },
    {
      "bottom" : "290",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_127",
      "top" : "291",
      "type" : "activation",
      "name" : "Sigmoid_127"
    },
    {
      "bottom" : "290,291",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_128",
      "top" : "292",
      "type" : "elementwise",
      "name" : "Mul_128",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_129",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "293",
      "K" : 256,
      "blob_biases" : 161,
      "name" : "Conv_129",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "292",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 163
    },
    {
      "bottom" : "293",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_130",
      "top" : "294",
      "type" : "activation",
      "name" : "Sigmoid_130"
    },
    {
      "bottom" : "293,294",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_131",
      "top" : "295",
      "type" : "elementwise",
      "name" : "Mul_131",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_132",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "296",
      "K" : 256,
      "blob_biases" : 165,
      "name" : "Conv_132",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "295",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 167
    },
    {
      "bottom" : "296",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_133",
      "top" : "297",
      "type" : "activation",
      "name" : "Sigmoid_133"
    },
    {
      "bottom" : "296,297",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_134",
      "top" : "298",
      "type" : "elementwise",
      "name" : "Mul_134",
      "beta" : 0
    },
    {
      "bottom" : "289,298",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Add_135",
      "top" : "299",
      "type" : "elementwise",
      "name" : "Add_135",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_136",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "300",
      "K" : 256,
      "blob_biases" : 169,
      "name" : "Conv_136",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "286",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 171
    },
    {
      "bottom" : "300",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_137",
      "top" : "301",
      "type" : "activation",
      "name" : "Sigmoid_137"
    },
    {
      "bottom" : "300,301",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_138",
      "top" : "302",
      "type" : "elementwise",
      "name" : "Mul_138",
      "beta" : 0
    },
    {
      "weights" : {

      },
      "debug_info" : "Concat_139",
      "top" : "303",
      "type" : "concat",
      "name" : "Concat_139",
      "bottom" : "299,302"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_140",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "304",
      "K" : 256,
      "blob_biases" : 173,
      "name" : "Conv_140",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "303",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 175
    },
    {
      "bottom" : "304",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_141",
      "top" : "305",
      "type" : "activation",
      "name" : "Sigmoid_141"
    },
    {
      "bottom" : "304,305",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_142",
      "top" : "306",
      "type" : "elementwise",
      "name" : "Mul_142",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_143",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "307",
      "K" : 256,
      "blob_biases" : 177,
      "name" : "Conv_143",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "306",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 179
    },
    {
      "bottom" : "307",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_144",
      "top" : "308",
      "type" : "activation",
