{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "model\/bn_Conv1\/FusedBatchNormV3_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model\/Conv1_relu\/Relu6__relu6_relu__",
      "K" : 4,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "model\/bn_Conv1\/FusedBatchNormV3_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "input1",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 3
    },
    {
      "alpha" : -1,
      "bottom" : "model\/Conv1_relu\/Relu6__relu6_relu__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/Conv1_relu\/Relu6__relu6_neg__",
      "top" : "model\/Conv1_relu\/Relu6__relu6_neg__",
      "type" : "activation",
      "name" : "model\/Conv1_relu\/Relu6__relu6_neg__",
      "beta" : 0
    },
    {
      "bottom" : "model\/Conv1_relu\/Relu6__relu6_neg__",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model\/Conv1_relu\/Relu6__relu6_threshold6__",
      "top" : "model\/Conv1_relu\/Relu6__relu6_threshold6__",
      "type" : "elementwise",
      "name" : "model\/Conv1_relu\/Relu6__relu6_threshold6__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "model\/Conv1_relu\/Relu6__relu6_threshold6__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/Conv1_relu\/Relu6",
      "top" : "model\/Conv1_relu\/Relu6",
      "type" : "activation",
      "name" : "model\/Conv1_relu\/Relu6",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "model\/expanded_conv_depthwise_BN\/FusedBatchNormV3_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model\/expanded_conv_depthwise_relu\/Relu6__relu6_relu__",
      "K" : 32,
      "blob_biases" : 5,
      "name" : "model\/expanded_conv_depthwise_BN\/FusedBatchNormV3_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "model\/Conv1_relu\/Relu6",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 7
    },
    {
      "alpha" : -1,
      "bottom" : "model\/expanded_conv_depthwise_relu\/Relu6__relu6_relu__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/expanded_conv_depthwise_relu\/Relu6__relu6_neg__",
      "top" : "model\/expanded_conv_depthwise_relu\/Relu6__relu6_neg__",
      "type" : "activation",
      "name" : "model\/expanded_conv_depthwise_relu\/Relu6__relu6_neg__",
      "beta" : 0
    },
    {
      "bottom" : "model\/expanded_conv_depthwise_relu\/Relu6__relu6_neg__",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model\/expanded_conv_depthwise_relu\/Relu6__relu6_threshold6__",
      "top" : "model\/expanded_conv_depthwise_relu\/Relu6__relu6_threshold6__",
      "type" : "elementwise",
      "name" : "model\/expanded_conv_depthwise_relu\/Relu6__relu6_threshold6__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "model\/expanded_conv_depthwise_relu\/Relu6__relu6_threshold6__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/expanded_conv_depthwise_relu\/Relu6",
      "top" : "model\/expanded_conv_depthwise_relu\/Relu6",
      "type" : "activation",
      "name" : "model\/expanded_conv_depthwise_relu\/Relu6",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model\/expanded_conv_project_BN\/FusedBatchNormV3_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model\/expanded_conv_project_BN\/FusedBatchNormV3_nchw",
      "K" : 32,
      "blob_biases" : 9,
      "name" : "model\/expanded_conv_project_BN\/FusedBatchNormV3_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "model\/expanded_conv_depthwise_relu\/Relu6",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 11
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "model\/block_1_expand_BN\/FusedBatchNormV3_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model\/block_1_expand_relu\/Relu6__relu6_relu__",
      "K" : 16,
      "blob_biases" : 13,
      "name" : "model\/block_1_expand_BN\/FusedBatchNormV3_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "model\/expanded_conv_project_BN\/FusedBatchNormV3_nchw",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 15
    },
    {
      "alpha" : -1,
      "bottom" : "model\/block_1_expand_relu\/Relu6__relu6_relu__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/block_1_expand_relu\/Relu6__relu6_neg__",
      "top" : "model\/block_1_expand_relu\/Relu6__relu6_neg__",
      "type" : "activation",
      "name" : "model\/block_1_expand_relu\/Relu6__relu6_neg__",
      "beta" : 0
    },
    {
      "bottom" : "model\/block_1_expand_relu\/Relu6__relu6_neg__",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model\/block_1_expand_relu\/Relu6__relu6_threshold6__",
      "top" : "model\/block_1_expand_relu\/Relu6__relu6_threshold6__",
      "type" : "elementwise",
      "name" : "model\/block_1_expand_relu\/Relu6__relu6_threshold6__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "model\/block_1_expand_relu\/Relu6__relu6_threshold6__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/block_1_expand_relu\/Relu6",
      "top" : "model\/block_1_expand_relu\/Relu6",
      "type" : "activation",
      "name" : "model\/block_1_expand_relu\/Relu6",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "model\/block_1_depthwise_BN\/FusedBatchNormV3_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 0,
      "top" : "model\/block_1_depthwise_relu\/Relu6__relu6_relu__",
      "K" : 96,
      "blob_biases" : 17,
      "stride_x" : 2,
      "name" : "model\/block_1_depthwise_BN\/FusedBatchNormV3_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 96,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "model\/block_1_expand_relu\/Relu6",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 19
    },
    {
      "alpha" : -1,
      "bottom" : "model\/block_1_depthwise_relu\/Relu6__relu6_relu__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/block_1_depthwise_relu\/Relu6__relu6_neg__",
      "top" : "model\/block_1_depthwise_relu\/Relu6__relu6_neg__",
      "type" : "activation",
      "name" : "model\/block_1_depthwise_relu\/Relu6__relu6_neg__",
      "beta" : 0
    },
    {
      "bottom" : "model\/block_1_depthwise_relu\/Relu6__relu6_neg__",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model\/block_1_depthwise_relu\/Relu6__relu6_threshold6__",
      "top" : "model\/block_1_depthwise_relu\/Relu6__relu6_threshold6__",
      "type" : "elementwise",
      "name" : "model\/block_1_depthwise_relu\/Relu6__relu6_threshold6__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "model\/block_1_depthwise_relu\/Relu6__relu6_threshold6__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/block_1_depthwise_relu\/Relu6",
      "top" : "model\/block_1_depthwise_relu\/Relu6",
      "type" : "activation",
      "name" : "model\/block_1_depthwise_relu\/Relu6",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model\/block_1_project_BN\/FusedBatchNormV3_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model\/block_1_project_BN\/FusedBatchNormV3_nchw",
      "K" : 96,
      "blob_biases" : 21,
      "name" : "model\/block_1_project_BN\/FusedBatchNormV3_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "model\/block_1_depthwise_relu\/Relu6",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 23
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "model\/block_2_expand_BN\/FusedBatchNormV3_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model\/block_2_expand_relu\/Relu6__relu6_relu__",
      "K" : 24,
      "blob_biases" : 25,
      "name" : "model\/block_2_expand_BN\/FusedBatchNormV3_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "model\/block_1_project_BN\/FusedBatchNormV3_nchw",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 27
    },
    {
      "alpha" : -1,
      "bottom" : "model\/block_2_expand_relu\/Relu6__relu6_relu__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/block_2_expand_relu\/Relu6__relu6_neg__",
      "top" : "model\/block_2_expand_relu\/Relu6__relu6_neg__",
      "type" : "activation",
      "name" : "model\/block_2_expand_relu\/Relu6__relu6_neg__",
      "beta" : 0
    },
    {
      "bottom" : "model\/block_2_expand_relu\/Relu6__relu6_neg__",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model\/block_2_expand_relu\/Relu6__relu6_threshold6__",
      "top" : "model\/block_2_expand_relu\/Relu6__relu6_threshold6__",
      "type" : "elementwise",
      "name" : "model\/block_2_expand_relu\/Relu6__relu6_threshold6__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "model\/block_2_expand_relu\/Relu6__relu6_threshold6__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/block_2_expand_relu\/Relu6",
      "top" : "model\/block_2_expand_relu\/Relu6",
      "type" : "activation",
      "name" : "model\/block_2_expand_relu\/Relu6",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "model\/block_2_depthwise_BN\/FusedBatchNormV3_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model\/block_2_depthwise_relu\/Relu6__relu6_relu__",
      "K" : 144,
      "blob_biases" : 29,
      "name" : "model\/block_2_depthwise_BN\/FusedBatchNormV3_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 144,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "model\/block_2_expand_relu\/Relu6",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 31
    },
    {
      "alpha" : -1,
      "bottom" : "model\/block_2_depthwise_relu\/Relu6__relu6_relu__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/block_2_depthwise_relu\/Relu6__relu6_neg__",
      "top" : "model\/block_2_depthwise_relu\/Relu6__relu6_neg__",
      "type" : "activation",
      "name" : "model\/block_2_depthwise_relu\/Relu6__relu6_neg__",
      "beta" : 0
    },
    {
      "bottom" : "model\/block_2_depthwise_relu\/Relu6__relu6_neg__",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model\/block_2_depthwise_relu\/Relu6__relu6_threshold6__",
      "top" : "model\/block_2_depthwise_relu\/Relu6__relu6_threshold6__",
      "type" : "elementwise",
      "name" : "model\/block_2_depthwise_relu\/Relu6__relu6_threshold6__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "model\/block_2_depthwise_relu\/Relu6__relu6_threshold6__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/block_2_depthwise_relu\/Relu6",
      "top" : "model\/block_2_depthwise_relu\/Relu6",
      "type" : "activation",
      "name" : "model\/block_2_depthwise_relu\/Relu6",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model\/block_2_project_BN\/FusedBatchNormV3_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model\/block_2_project_BN\/FusedBatchNormV3_nchw",
      "K" : 144,
      "blob_biases" : 33,
      "name" : "model\/block_2_project_BN\/FusedBatchNormV3_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "model\/block_2_depthwise_relu\/Relu6",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 35
    },
    {
      "bottom" : "model\/block_1_project_BN\/FusedBatchNormV3_nchw,model\/block_2_project_BN\/FusedBatchNormV3_nchw",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model\/block_2_add\/add",
      "top" : "model\/block_2_add\/add",
      "type" : "elementwise",
      "name" : "model\/block_2_add\/add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "model\/block_3_expand_BN\/FusedBatchNormV3_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model\/block_3_expand_relu\/Relu6__relu6_relu__",
      "K" : 24,
      "blob_biases" : 37,
      "name" : "model\/block_3_expand_BN\/FusedBatchNormV3_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "model\/block_2_add\/add",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 39
    },
    {
      "alpha" : -1,
      "bottom" : "model\/block_3_expand_relu\/Relu6__relu6_relu__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/block_3_expand_relu\/Relu6__relu6_neg__",
      "top" : "model\/block_3_expand_relu\/Relu6__relu6_neg__",
      "type" : "activation",
      "name" : "model\/block_3_expand_relu\/Relu6__relu6_neg__",
      "beta" : 0
    },
    {
      "bottom" : "model\/block_3_expand_relu\/Relu6__relu6_neg__",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model\/block_3_expand_relu\/Relu6__relu6_threshold6__",
      "top" : "model\/block_3_expand_relu\/Relu6__relu6_threshold6__",
      "type" : "elementwise",
      "name" : "model\/block_3_expand_relu\/Relu6__relu6_threshold6__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "model\/block_3_expand_relu\/Relu6__relu6_threshold6__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/block_3_expand_relu\/Relu6",
      "top" : "model\/block_3_expand_relu\/Relu6",
      "type" : "activation",
      "name" : "model\/block_3_expand_relu\/Relu6",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "model\/block_3_depthwise_BN\/FusedBatchNormV3_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 0,
      "top" : "model\/block_3_depthwise_relu\/Relu6__relu6_relu__",
      "K" : 144,
      "blob_biases" : 41,
      "stride_x" : 2,
      "name" : "model\/block_3_depthwise_BN\/FusedBatchNormV3_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 144,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "model\/block_3_expand_relu\/Relu6",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 43
    },
    {
      "alpha" : -1,
      "bottom" : "model\/block_3_depthwise_relu\/Relu6__relu6_relu__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/block_3_depthwise_relu\/Relu6__relu6_neg__",
      "top" : "model\/block_3_depthwise_relu\/Relu6__relu6_neg__",
      "type" : "activation",
      "name" : "model\/block_3_depthwise_relu\/Relu6__relu6_neg__",
      "beta" : 0
    },
    {
      "bottom" : "model\/block_3_depthwise_relu\/Relu6__relu6_neg__",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model\/block_3_depthwise_relu\/Relu6__relu6_threshold6__",
      "top" : "model\/block_3_depthwise_relu\/Relu6__relu6_threshold6__",
      "type" : "elementwise",
      "name" : "model\/block_3_depthwise_relu\/Relu6__relu6_threshold6__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "model\/block_3_depthwise_relu\/Relu6__relu6_threshold6__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/block_3_depthwise_relu\/Relu6",
      "top" : "model\/block_3_depthwise_relu\/Relu6",
      "type" : "activation",
      "name" : "model\/block_3_depthwise_relu\/Relu6",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model\/block_3_project_BN\/FusedBatchNormV3_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model\/block_3_project_BN\/FusedBatchNormV3_nchw",
      "K" : 144,
      "blob_biases" : 45,
      "name" : "model\/block_3_project_BN\/FusedBatchNormV3_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "model\/block_3_depthwise_relu\/Relu6",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 47
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "model\/block_4_expand_BN\/FusedBatchNormV3_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model\/block_4_expand_relu\/Relu6__relu6_relu__",
      "K" : 32,
      "blob_biases" : 49,
      "name" : "model\/block_4_expand_BN\/FusedBatchNormV3_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "model\/block_3_project_BN\/FusedBatchNormV3_nchw",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 51
    },
    {
      "alpha" : -1,
      "bottom" : "model\/block_4_expand_relu\/Relu6__relu6_relu__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/block_4_expand_relu\/Relu6__relu6_neg__",
      "top" : "model\/block_4_expand_relu\/Relu6__relu6_neg__",
      "type" : "activation",
      "name" : "model\/block_4_expand_relu\/Relu6__relu6_neg__",
      "beta" : 0
    },
    {
      "bottom" : "model\/block_4_expand_relu\/Relu6__relu6_neg__",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model\/block_4_expand_relu\/Relu6__relu6_threshold6__",
      "top" : "model\/block_4_expand_relu\/Relu6__relu6_threshold6__",
      "type" : "elementwise",
      "name" : "model\/block_4_expand_relu\/Relu6__relu6_threshold6__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "model\/block_4_expand_relu\/Relu6__relu6_threshold6__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/block_4_expand_relu\/Relu6",
      "top" : "model\/block_4_expand_relu\/Relu6",
      "type" : "activation",
      "name" : "model\/block_4_expand_relu\/Relu6",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "model\/block_4_depthwise_BN\/FusedBatchNormV3_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model\/block_4_depthwise_relu\/Relu6__relu6_relu__",
      "K" : 192,
      "blob_biases" : 53,
      "name" : "model\/block_4_depthwise_BN\/FusedBatchNormV3_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 192,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "model\/block_4_expand_relu\/Relu6",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 55
    },
    {
      "alpha" : -1,
      "bottom" : "model\/block_4_depthwise_relu\/Relu6__relu6_relu__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/block_4_depthwise_relu\/Relu6__relu6_neg__",
      "top" : "model\/block_4_depthwise_relu\/Relu6__relu6_neg__",
      "type" : "activation",
      "name" : "model\/block_4_depthwise_relu\/Relu6__relu6_neg__",
      "beta" : 0
    },
    {
      "bottom" : "model\/block_4_depthwise_relu\/Relu6__relu6_neg__",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model\/block_4_depthwise_relu\/Relu6__relu6_threshold6__",
      "top" : "model\/block_4_depthwise_relu\/Relu6__relu6_threshold6__",
      "type" : "elementwise",
      "name" : "model\/block_4_depthwise_relu\/Relu6__relu6_threshold6__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "model\/block_4_depthwise_relu\/Relu6__relu6_threshold6__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/block_4_depthwise_relu\/Relu6",
      "top" : "model\/block_4_depthwise_relu\/Relu6",
      "type" : "activation",
      "name" : "model\/block_4_depthwise_relu\/Relu6",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model\/block_4_project_BN\/FusedBatchNormV3_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model\/block_4_project_BN\/FusedBatchNormV3_nchw",
      "K" : 192,
      "blob_biases" : 57,
      "name" : "model\/block_4_project_BN\/FusedBatchNormV3_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "model\/block_4_depthwise_relu\/Relu6",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 59
    },
    {
      "bottom" : "model\/block_3_project_BN\/FusedBatchNormV3_nchw,model\/block_4_project_BN\/FusedBatchNormV3_nchw",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model\/block_4_add\/add",
      "top" : "model\/block_4_add\/add",
      "type" : "elementwise",
      "name" : "model\/block_4_add\/add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "model\/block_5_expand_BN\/FusedBatchNormV3_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model\/block_5_expand_relu\/Relu6__relu6_relu__",
      "K" : 32,
      "blob_biases" : 61,
      "name" : "model\/block_5_expand_BN\/FusedBatchNormV3_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "model\/block_4_add\/add",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 63
    },
    {
      "alpha" : -1,
      "bottom" : "model\/block_5_expand_relu\/Relu6__relu6_relu__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/block_5_expand_relu\/Relu6__relu6_neg__",
      "top" : "model\/block_5_expand_relu\/Relu6__relu6_neg__",
      "type" : "activation",
      "name" : "model\/block_5_expand_relu\/Relu6__relu6_neg__",
      "beta" : 0
    },
    {
      "bottom" : "model\/block_5_expand_relu\/Relu6__relu6_neg__",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model\/block_5_expand_relu\/Relu6__relu6_threshold6__",
      "top" : "model\/block_5_expand_relu\/Relu6__relu6_threshold6__",
      "type" : "elementwise",
      "name" : "model\/block_5_expand_relu\/Relu6__relu6_threshold6__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "model\/block_5_expand_relu\/Relu6__relu6_threshold6__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/block_5_expand_relu\/Relu6",
      "top" : "model\/block_5_expand_relu\/Relu6",
      "type" : "activation",
      "name" : "model\/block_5_expand_relu\/Relu6",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "model\/block_5_depthwise_BN\/FusedBatchNormV3_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model\/block_5_depthwise_relu\/Relu6__relu6_relu__",
      "K" : 192,
      "blob_biases" : 65,
      "name" : "model\/block_5_depthwise_BN\/FusedBatchNormV3_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 192,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "model\/block_5_expand_relu\/Relu6",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 67
    },
    {
      "alpha" : -1,
      "bottom" : "model\/block_5_depthwise_relu\/Relu6__relu6_relu__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/block_5_depthwise_relu\/Relu6__relu6_neg__",
      "top" : "model\/block_5_depthwise_relu\/Relu6__relu6_neg__",
      "type" : "activation",
      "name" : "model\/block_5_depthwise_relu\/Relu6__relu6_neg__",
      "beta" : 0
    },
    {
      "bottom" : "model\/block_5_depthwise_relu\/Relu6__relu6_neg__",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model\/block_5_depthwise_relu\/Relu6__relu6_threshold6__",
      "top" : "model\/block_5_depthwise_relu\/Relu6__relu6_threshold6__",
      "type" : "elementwise",
      "name" : "model\/block_5_depthwise_relu\/Relu6__relu6_threshold6__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "model\/block_5_depthwise_relu\/Relu6__relu6_threshold6__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/block_5_depthwise_relu\/Relu6",
      "top" : "model\/block_5_depthwise_relu\/Relu6",
      "type" : "activation",
      "name" : "model\/block_5_depthwise_relu\/Relu6",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model\/block_5_project_BN\/FusedBatchNormV3_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model\/block_5_project_BN\/FusedBatchNormV3_nchw",
      "K" : 192,
      "blob_biases" : 69,
      "name" : "model\/block_5_project_BN\/FusedBatchNormV3_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "model\/block_5_depthwise_relu\/Relu6",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 71
    },
    {
      "bottom" : "model\/block_4_add\/add,model\/block_5_project_BN\/FusedBatchNormV3_nchw",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model\/block_5_add\/add",
      "top" : "model\/block_5_add\/add",
      "type" : "elementwise",
      "name" : "model\/block_5_add\/add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "model\/block_6_expand_BN\/FusedBatchNormV3_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model\/block_6_expand_relu\/Relu6__relu6_relu__",
      "K" : 32,
      "blob_biases" : 73,
      "name" : "model\/block_6_expand_BN\/FusedBatchNormV3_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "model\/block_5_add\/add",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 75
    },
    {
      "alpha" : -1,
      "bottom" : "model\/block_6_expand_relu\/Relu6__relu6_relu__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/block_6_expand_relu\/Relu6__relu6_neg__",
      "top" : "model\/block_6_expand_relu\/Relu6__relu6_neg__",
      "type" : "activation",
      "name" : "model\/block_6_expand_relu\/Relu6__relu6_neg__",
      "beta" : 0
    },
    {
      "bottom" : "model\/block_6_expand_relu\/Relu6__relu6_neg__",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model\/block_6_expand_relu\/Relu6__relu6_threshold6__",
      "top" : "model\/block_6_expand_relu\/Relu6__relu6_threshold6__",
      "type" : "elementwise",
      "name" : "model\/block_6_expand_relu\/Relu6__relu6_threshold6__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "model\/block_6_expand_relu\/Relu6__relu6_threshold6__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/block_6_expand_relu\/Relu6",
      "top" : "model\/block_6_expand_relu\/Relu6",
      "type" : "activation",
      "name" : "model\/block_6_expand_relu\/Relu6",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "model\/block_6_depthwise_BN\/FusedBatchNormV3_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 0,
      "top" : "model\/block_6_depthwise_relu\/Relu6__relu6_relu__",
      "K" : 192,
      "blob_biases" : 77,
      "stride_x" : 2,
      "name" : "model\/block_6_depthwise_BN\/FusedBatchNormV3_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 192,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "model\/block_6_expand_relu\/Relu6",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 79
    },
    {
      "alpha" : -1,
      "bottom" : "model\/block_6_depthwise_relu\/Relu6__relu6_relu__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/block_6_depthwise_relu\/Relu6__relu6_neg__",
      "top" : "model\/block_6_depthwise_relu\/Relu6__relu6_neg__",
      "type" : "activation",
      "name" : "model\/block_6_depthwise_relu\/Relu6__relu6_neg__",
      "beta" : 0
    },
    {
      "bottom" : "model\/block_6_depthwise_relu\/Relu6__relu6_neg__",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model\/block_6_depthwise_relu\/Relu6__relu6_threshold6__",
      "top" : "model\/block_6_depthwise_relu\/Relu6__relu6_threshold6__",
      "type" : "elementwise",
      "name" : "model\/block_6_depthwise_relu\/Relu6__relu6_threshold6__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "model\/block_6_depthwise_relu\/Relu6__relu6_threshold6__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/block_6_depthwise_relu\/Relu6",
      "top" : "model\/block_6_depthwise_relu\/Relu6",
      "type" : "activation",
      "name" : "model\/block_6_depthwise_relu\/Relu6",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model\/block_6_project_BN\/FusedBatchNormV3_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model\/block_6_project_BN\/FusedBatchNormV3_nchw",
      "K" : 192,
      "blob_biases" : 81,
      "name" : "model\/block_6_project_BN\/FusedBatchNormV3_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "model\/block_6_depthwise_relu\/Relu6",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 83
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "model\/block_7_expand_BN\/FusedBatchNormV3_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model\/block_7_expand_relu\/Relu6__relu6_relu__",
      "K" : 64,
      "blob_biases" : 85,
      "name" : "model\/block_7_expand_BN\/FusedBatchNormV3_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "model\/block_6_project_BN\/FusedBatchNormV3_nchw",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 87
    },
    {
      "alpha" : -1,
      "bottom" : "model\/block_7_expand_relu\/Relu6__relu6_relu__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/block_7_expand_relu\/Relu6__relu6_neg__",
      "top" : "model\/block_7_expand_relu\/Relu6__relu6_neg__",
      "type" : "activation",
      "name" : "model\/block_7_expand_relu\/Relu6__relu6_neg__",
      "beta" : 0
    },
    {
      "bottom" : "model\/block_7_expand_relu\/Relu6__relu6_neg__",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model\/block_7_expand_relu\/Relu6__relu6_threshold6__",
      "top" : "model\/block_7_expand_relu\/Relu6__relu6_threshold6__",
      "type" : "elementwise",
      "name" : "model\/block_7_expand_relu\/Relu6__relu6_threshold6__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "model\/block_7_expand_relu\/Relu6__relu6_threshold6__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/block_7_expand_relu\/Relu6",
      "top" : "model\/block_7_expand_relu\/Relu6",
      "type" : "activation",
      "name" : "model\/block_7_expand_relu\/Relu6",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "model\/block_7_depthwise_BN\/FusedBatchNormV3_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model\/block_7_depthwise_relu\/Relu6__relu6_relu__",
      "K" : 384,
      "blob_biases" : 89,
      "name" : "model\/block_7_depthwise_BN\/FusedBatchNormV3_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 384,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "model\/block_7_expand_relu\/Relu6",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 91
    },
    {
      "alpha" : -1,
      "bottom" : "model\/block_7_depthwise_relu\/Relu6__relu6_relu__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/block_7_depthwise_relu\/Relu6__relu6_neg__",
      "top" : "model\/block_7_depthwise_relu\/Relu6__relu6_neg__",
      "type" : "activation",
      "name" : "model\/block_7_depthwise_relu\/Relu6__relu6_neg__",
      "beta" : 0
    },
    {
      "bottom" : "model\/block_7_depthwise_relu\/Relu6__relu6_neg__",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model\/block_7_depthwise_relu\/Relu6__relu6_threshold6__",
      "top" : "model\/block_7_depthwise_relu\/Relu6__relu6_threshold6__",
      "type" : "elementwise",
      "name" : "model\/block_7_depthwise_relu\/Relu6__relu6_threshold6__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "model\/block_7_depthwise_relu\/Relu6__relu6_threshold6__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/block_7_depthwise_relu\/Relu6",
      "top" : "model\/block_7_depthwise_relu\/Relu6",
      "type" : "activation",
      "name" : "model\/block_7_depthwise_relu\/Relu6",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model\/block_7_project_BN\/FusedBatchNormV3_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model\/block_7_project_BN\/FusedBatchNormV3_nchw",
      "K" : 384,
      "blob_biases" : 93,
      "name" : "model\/block_7_project_BN\/FusedBatchNormV3_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "model\/block_7_depthwise_relu\/Relu6",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 95
    },
    {
      "bottom" : "model\/block_6_project_BN\/FusedBatchNormV3_nchw,model\/block_7_project_BN\/FusedBatchNormV3_nchw",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model\/block_7_add\/add",
      "top" : "model\/block_7_add\/add",
      "type" : "elementwise",
      "name" : "model\/block_7_add\/add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "model\/block_8_expand_BN\/FusedBatchNormV3_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model\/block_8_expand_relu\/Relu6__relu6_relu__",
      "K" : 64,
      "blob_biases" : 97,
      "name" : "model\/block_8_expand_BN\/FusedBatchNormV3_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "model\/block_7_add\/add",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 99
    },
    {
      "alpha" : -1,
      "bottom" : "model\/block_8_expand_relu\/Relu6__relu6_relu__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/block_8_expand_relu\/Relu6__relu6_neg__",
      "top" : "model\/block_8_expand_relu\/Relu6__relu6_neg__",
      "type" : "activation",
      "name" : "model\/block_8_expand_relu\/Relu6__relu6_neg__",
      "beta" : 0
    },
    {
      "bottom" : "model\/block_8_expand_relu\/Relu6__relu6_neg__",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model\/block_8_expand_relu\/Relu6__relu6_threshold6__",
      "top" : "model\/block_8_expand_relu\/Relu6__relu6_threshold6__",
      "type" : "elementwise",
      "name" : "model\/block_8_expand_relu\/Relu6__relu6_threshold6__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "model\/block_8_expand_relu\/Relu6__relu6_threshold6__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/block_8_expand_relu\/Relu6",
      "top" : "model\/block_8_expand_relu\/Relu6",
      "type" : "activation",
      "name" : "model\/block_8_expand_relu\/Relu6",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "model\/block_8_depthwise_BN\/FusedBatchNormV3_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model\/block_8_depthwise_relu\/Relu6__relu6_relu__",
      "K" : 384,
      "blob_biases" : 101,
      "name" : "model\/block_8_depthwise_BN\/FusedBatchNormV3_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 384,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "model\/block_8_expand_relu\/Relu6",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 103
    },
    {
      "alpha" : -1,
      "bottom" : "model\/block_8_depthwise_relu\/Relu6__relu6_relu__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/block_8_depthwise_relu\/Relu6__relu6_neg__",
      "top" : "model\/block_8_depthwise_relu\/Relu6__relu6_neg__",
      "type" : "activation",
      "name" : "model\/block_8_depthwise_relu\/Relu6__relu6_neg__",
      "beta" : 0
    },
    {
      "bottom" : "model\/block_8_depthwise_relu\/Relu6__relu6_neg__",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model\/block_8_depthwise_relu\/Relu6__relu6_threshold6__",
      "top" : "model\/block_8_depthwise_relu\/Relu6__relu6_threshold6__",
      "type" : "elementwise",
      "name" : "model\/block_8_depthwise_relu\/Relu6__relu6_threshold6__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "model\/block_8_depthwise_relu\/Relu6__relu6_threshold6__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/block_8_depthwise_relu\/Relu6",
      "top" : "model\/block_8_depthwise_relu\/Relu6",
      "type" : "activation",
      "name" : "model\/block_8_depthwise_relu\/Relu6",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model\/block_8_project_BN\/FusedBatchNormV3_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model\/block_8_project_BN\/FusedBatchNormV3_nchw",
      "K" : 384,
      "blob_biases" : 105,
      "name" : "model\/block_8_project_BN\/FusedBatchNormV3_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "model\/block_8_depthwise_relu\/Relu6",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 107
    },
    {
      "bottom" : "model\/block_7_add\/add,model\/block_8_project_BN\/FusedBatchNormV3_nchw",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model\/block_8_add\/add",
      "top" : "model\/block_8_add\/add",
      "type" : "elementwise",
      "name" : "model\/block_8_add\/add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "model\/block_9_expand_BN\/FusedBatchNormV3_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model\/block_9_expand_relu\/Relu6__relu6_relu__",
      "K" : 64,
      "blob_biases" : 109,
      "name" : "model\/block_9_expand_BN\/FusedBatchNormV3_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "model\/block_8_add\/add",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 111
    },
    {
      "alpha" : -1,
      "bottom" : "model\/block_9_expand_relu\/Relu6__relu6_relu__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/block_9_expand_relu\/Relu6__relu6_neg__",
      "top" : "model\/block_9_expand_relu\/Relu6__relu6_neg__",
      "type" : "activation",
      "name" : "model\/block_9_expand_relu\/Relu6__relu6_neg__",
      "beta" : 0
    },
    {
      "bottom" : "model\/block_9_expand_relu\/Relu6__relu6_neg__",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model\/block_9_expand_relu\/Relu6__relu6_threshold6__",
      "top" : "model\/block_9_expand_relu\/Relu6__relu6_threshold6__",
      "type" : "elementwise",
      "name" : "model\/block_9_expand_relu\/Relu6__relu6_threshold6__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "model\/block_9_expand_relu\/Relu6__relu6_threshold6__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/block_9_expand_relu\/Relu6",
      "top" : "model\/block_9_expand_relu\/Relu6",
      "type" : "activation",
      "name" : "model\/block_9_expand_relu\/Relu6",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "model\/block_9_depthwise_BN\/FusedBatchNormV3_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model\/block_9_depthwise_relu\/Relu6__relu6_relu__",
      "K" : 384,
      "blob_biases" : 113,
      "name" : "model\/block_9_depthwise_BN\/FusedBatchNormV3_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 384,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "model\/block_9_expand_relu\/Relu6",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 115
    },
    {
      "alpha" : -1,
      "bottom" : "model\/block_9_depthwise_relu\/Relu6__relu6_relu__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/block_9_depthwise_relu\/Relu6__relu6_neg__",
      "top" : "model\/block_9_depthwise_relu\/Relu6__relu6_neg__",
      "type" : "activation",
      "name" : "model\/block_9_depthwise_relu\/Relu6__relu6_neg__",
      "beta" : 0
    },
    {
      "bottom" : "model\/block_9_depthwise_relu\/Relu6__relu6_neg__",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model\/block_9_depthwise_relu\/Relu6__relu6_threshold6__",
      "top" : "model\/block_9_depthwise_relu\/Relu6__relu6_threshold6__",
      "type" : "elementwise",
      "name" : "model\/block_9_depthwise_relu\/Relu6__relu6_threshold6__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "model\/block_9_depthwise_relu\/Relu6__relu6_threshold6__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "model\/block_9_depthwise_relu\/Relu6",
      "top" : "model\/block_9_depthwise_relu\/Relu6",
      "type" : "activation",
      "name" : "model\/block_9_depthwise_relu\/Relu6",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model\/block_9_project_BN\/FusedBatchNormV3_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model\/block_9_project_BN\/FusedBatchNormV3_nchw",
      "K" : 384,
      "blob_biases" : 117,
      "name" : "model\/block_9_project_BN\/FusedBatchNormV3_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "model\/block_9_depthwise_relu\/Relu6",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 119
    },
    {
      "bottom" : "model\/block_8_add\/add,model\/block_9_project_BN\/FusedBatchNormV3_nchw",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model\/block_9_add\/add",
      "top" : "model\/block_9_add\/add",
      "type" : "elementwise",
      "name" : "model\/block_9_add\/add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "model\/block_10_expand_BN\/FusedBatchNormV3_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model\/block_10_expand_relu\/Relu6__relu6_relu__",
      "K" : 64,
      "blob_biases" : 121,
      "name" : "model\/block_10_expand_BN\/FusedBatchNormV3_nchw",
