{
  "storage" : "model.espresso.weights",
  "properties" : {

  },
  "format_version" : 200,
  "layers" : [
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "eye-encoder_batch_0_output",
      "K" : 6,
      "blob_biases" : 1,
      "name" : "eye-encoder_conv_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "input1",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 3
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "eye-skip_conv_0_output",
      "K" : 32,
      "blob_biases" : 5,
      "name" : "eye-skip_conv_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "eye-encoder_batch_0_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 7
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 9
      },
      "top" : "eye-encoder_relu_0_output",
      "type" : "activation",
      "name" : "eye-encoder_relu_0",
      "bottom" : "eye-skip_conv_0_output"
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 2,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 2,
      "pad_fill_mode" : 0,
      "bottom" : "eye-encoder_relu_0_output",
      "pad_l" : 0,
      "name" : "eye-encoder_pool_0",
      "top" : "eye-encoder_pool_0_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "eye-encoder_batch_1_output",
      "K" : 16,
      "blob_biases" : 11,
      "name" : "eye-encoder_conv_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 40,
      "bottom" : "eye-encoder_pool_0_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 13
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "eye-skip_conv_1_output",
      "K" : 40,
      "blob_biases" : 15,
      "name" : "eye-skip_conv_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 20,
      "bottom" : "eye-encoder_batch_1_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 17
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 19
      },
      "top" : "eye-encoder_relu_1_output",
      "type" : "activation",
      "name" : "eye-encoder_relu_1",
      "bottom" : "eye-skip_conv_1_output"
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 2,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 2,
      "pad_fill_mode" : 0,
      "bottom" : "eye-encoder_relu_1_output",
      "pad_l" : 0,
      "name" : "eye-encoder_pool_1",
      "top" : "eye-encoder_pool_1_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "eye-encoder_batch_2_output",
      "K" : 20,
      "blob_biases" : 21,
      "name" : "eye-encoder_conv_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "eye-encoder_pool_1_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 23
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "eye-skip_conv_2_output",
      "K" : 48,
      "blob_biases" : 25,
      "name" : "eye-skip_conv_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "eye-encoder_batch_2_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 27
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 29
      },
      "top" : "eye-encoder_relu_2_output",
      "type" : "activation",
      "name" : "eye-encoder_relu_2",
      "bottom" : "eye-skip_conv_2_output"
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 2,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 2,
      "pad_fill_mode" : 0,
      "bottom" : "eye-encoder_relu_2_output",
      "pad_l" : 0,
      "name" : "eye-encoder_pool_2",
      "top" : "eye-encoder_pool_2_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "eye-encoder_batch_3_output",
      "K" : 24,
      "blob_biases" : 31,
      "name" : "eye-encoder_conv_3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "eye-encoder_pool_2_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 33
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "eye-skip_conv_3_output",
      "K" : 64,
      "blob_biases" : 35,
      "name" : "eye-skip_conv_3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "eye-encoder_batch_3_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 37
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 39
      },
      "top" : "eye-encoder_relu_3_output",
      "type" : "activation",
      "name" : "eye-encoder_relu_3",
      "bottom" : "eye-skip_conv_3_output"
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 2,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 2,
      "pad_fill_mode" : 0,
      "bottom" : "eye-encoder_relu_3_output",
      "pad_l" : 0,
      "name" : "eye-encoder_pool_3",
      "top" : "eye-encoder_pool_3_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "eye-encoder_batch_4_output",
      "K" : 32,
      "blob_biases" : 41,
      "name" : "eye-encoder_conv_4",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "eye-encoder_pool_3_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 43
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "eye-skip_conv_4_output",
      "K" : 96,
      "blob_biases" : 45,
      "name" : "eye-skip_conv_4",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "eye-encoder_batch_4_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 47
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 49
      },
      "top" : "eye-encoder_relu_4_output",
      "type" : "activation",
      "name" : "eye-encoder_relu_4",
      "bottom" : "eye-skip_conv_4_output"
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 2,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 2,
      "pad_fill_mode" : 0,
      "bottom" : "eye-encoder_relu_4_output",
      "pad_l" : 0,
      "name" : "eye-encoder_pool_4",
      "top" : "eye-encoder_pool_4_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "eye-encoder_batch_5_output",
      "K" : 48,
      "blob_biases" : 51,
      "name" : "eye-encoder_conv_5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "eye-encoder_pool_4_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 53
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "eye-skip_conv_5_output",
      "K" : 128,
      "blob_biases" : 55,
      "name" : "eye-skip_conv_5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "eye-encoder_batch_5_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 57
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 59
      },
      "top" : "eye-encoder_relu_5_output",
      "type" : "activation",
      "name" : "eye-encoder_relu_5",
      "bottom" : "eye-skip_conv_5_output"
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 2,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 2,
      "pad_fill_mode" : 0,
      "bottom" : "eye-encoder_relu_5_output",
      "pad_l" : 0,
      "name" : "eye-encoder_pool_5",
      "top" : "eye-encoder_pool_5_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "eye-encoder_batch_6_output",
      "K" : 64,
      "blob_biases" : 61,
      "name" : "eye-encoder_conv_6",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "eye-encoder_pool_5_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 63
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "eye-skip_conv_6_output",
      "K" : 256,
      "blob_biases" : 65,
      "name" : "eye-skip_conv_6",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "eye-encoder_batch_6_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 67
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 69
      },
      "top" : "eye-encoder_relu_6_output",
      "type" : "activation",
      "name" : "eye-encoder_relu_6",
      "bottom" : "eye-skip_conv_6_output"
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 2,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 2,
      "pad_fill_mode" : 0,
      "bottom" : "eye-encoder_relu_6_output",
      "pad_l" : 0,
      "name" : "eye-encoder_pool_6",
      "top" : "eye-encoder_pool_6_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "eye-decoder_batch_6_output",
      "K" : 128,
      "blob_biases" : 71,
      "name" : "eye-decoder_conv_6",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "eye-encoder_pool_6_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 73
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 75
      },
      "top" : "eye-decoder_relu_6_output",
      "type" : "activation",
      "name" : "eye-decoder_relu_6",
      "bottom" : "eye-decoder_batch_6_output"
    },
    {
      "bottom" : "eye-decoder_relu_6_output",
      "scaling_factor_y" : 2,
      "weights" : {

      },
      "mode" : 0,
      "top" : "eye-decoder_upsampling_6_output",
      "scaling_factor_x" : 2,
      "type" : "upsample",
      "name" : "eye-decoder_upsampling_6"
    },
    {
      "weights" : {

      },
      "top" : "eye-decoder_concatenate_6_output",
      "type" : "concat",
      "name" : "eye-decoder_concatenate_6",
      "bottom" : "eye-decoder_upsampling_6_output,eye-skip_conv_6_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "eye-decoder_batch_5_output",
      "K" : 384,
      "blob_biases" : 77,
      "name" : "eye-decoder_conv_5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "eye-decoder_concatenate_6_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 79
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 81
      },
      "top" : "eye-decoder_relu_5_output",
      "type" : "activation",
      "name" : "eye-decoder_relu_5",
      "bottom" : "eye-decoder_batch_5_output"
    },
    {
      "bottom" : "eye-decoder_relu_5_output",
      "scaling_factor_y" : 2,
      "weights" : {

      },
      "mode" : 0,
      "top" : "eye-decoder_upsampling_5_output",
      "scaling_factor_x" : 2,
      "type" : "upsample",
      "name" : "eye-decoder_upsampling_5"
    },
    {
      "weights" : {

      },
      "top" : "eye-decoder_concatenate_5_output",
      "type" : "concat",
      "name" : "eye-decoder_concatenate_5",
      "bottom" : "eye-decoder_upsampling_5_output,eye-skip_conv_5_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "eye-decoder_batch_4_output",
      "K" : 192,
      "blob_biases" : 83,
      "name" : "eye-decoder_conv_4",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "eye-decoder_concatenate_5_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 85
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 87
      },
      "top" : "eye-decoder_relu_4_output",
      "type" : "activation",
      "name" : "eye-decoder_relu_4",
      "bottom" : "eye-decoder_batch_4_output"
    },
    {
      "bottom" : "eye-decoder_relu_4_output",
      "scaling_factor_y" : 2,
      "weights" : {

      },
      "mode" : 0,
      "top" : "eye-decoder_upsampling_4_output",
      "scaling_factor_x" : 2,
      "type" : "upsample",
      "name" : "eye-decoder_upsampling_4"
    },
    {
      "weights" : {

      },
      "top" : "eye-decoder_concatenate_4_output",
      "type" : "concat",
      "name" : "eye-decoder_concatenate_4",
      "bottom" : "eye-decoder_upsampling_4_output,eye-skip_conv_4_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "eye-decoder_batch_3_output",
      "K" : 144,
      "blob_biases" : 89,
      "name" : "eye-decoder_conv_3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "eye-decoder_concatenate_4_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 91
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 93
      },
      "top" : "eye-decoder_relu_3_output",
      "type" : "activation",
      "name" : "eye-decoder_relu_3",
      "bottom" : "eye-decoder_batch_3_output"
    },
    {
      "bottom" : "eye-decoder_relu_3_output",
      "scaling_factor_y" : 2,
      "weights" : {

      },
      "mode" : 0,
      "top" : "eye-decoder_upsampling_3_output",
      "scaling_factor_x" : 2,
      "type" : "upsample",
      "name" : "eye-decoder_upsampling_3"
    },
    {
      "weights" : {

      },
      "top" : "eye-decoder_concatenate_3_output",
      "type" : "concat",
      "name" : "eye-decoder_concatenate_3",
      "bottom" : "eye-decoder_upsampling_3_output,eye-skip_conv_3_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "eye-decoder_batch_2_output",
      "K" : 96,
      "blob_biases" : 95,
      "name" : "eye-decoder_conv_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "eye-decoder_concatenate_3_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 97
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 99
      },
      "top" : "eye-decoder_relu_2_output",
      "type" : "activation",
      "name" : "eye-decoder_relu_2",
      "bottom" : "eye-decoder_batch_2_output"
    },
    {
      "bottom" : "eye-decoder_relu_2_output",
      "scaling_factor_y" : 2,
      "weights" : {

      },
      "mode" : 0,
      "top" : "eye-decoder_upsampling_2_output",
      "scaling_factor_x" : 2,
      "type" : "upsample",
      "name" : "eye-decoder_upsampling_2"
    },
    {
      "weights" : {

      },
      "top" : "eye-decoder_concatenate_2_output",
      "type" : "concat",
      "name" : "eye-decoder_concatenate_2",
      "bottom" : "eye-decoder_upsampling_2_output,eye-skip_conv_2_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "eye-decoder_batch_1_output",
      "K" : 72,
      "blob_biases" : 101,
      "name" : "eye-decoder_conv_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 40,
      "bottom" : "eye-decoder_concatenate_2_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 103
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 105
      },
      "top" : "eye-decoder_relu_1_output",
      "type" : "activation",
      "name" : "eye-decoder_relu_1",
      "bottom" : "eye-decoder_batch_1_output"
    },
    {
      "bottom" : "eye-decoder_relu_1_output",
      "scaling_factor_y" : 2,
      "weights" : {

      },
      "mode" : 0,
      "top" : "eye-decoder_upsampling_1_output",
      "scaling_factor_x" : 2,
      "type" : "upsample",
      "name" : "eye-decoder_upsampling_1"
    },
    {
      "weights" : {

      },
      "top" : "eye-decoder_concatenate_1_output",
      "type" : "concat",
      "name" : "eye-decoder_concatenate_1",
      "bottom" : "eye-decoder_upsampling_1_output,eye-skip_conv_1_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "eye-decoder_batch_0_output",
      "K" : 60,
      "blob_biases" : 107,
      "name" : "eye-decoder_conv_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "eye-decoder_concatenate_1_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 109
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 111
      },
      "top" : "eye-decoder_relu_0_output",
      "type" : "activation",
      "name" : "eye-decoder_relu_0",
      "bottom" : "eye-decoder_batch_0_output"
    },
    {
      "bottom" : "eye-decoder_relu_0_output",
      "scaling_factor_y" : 2,
      "weights" : {

      },
      "mode" : 0,
      "top" : "eye-decoder_upsampling_0_output",
      "scaling_factor_x" : 2,
      "type" : "upsample",
      "name" : "eye-decoder_upsampling_0"
    },
    {
      "weights" : {

      },
      "top" : "eye-decoder_concatenate_0_output",
      "type" : "concat",
      "name" : "eye-decoder_concatenate_0",
      "bottom" : "input1,eye-decoder_upsampling_0_output,eye-skip_conv_0_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "output1",
      "K" : 54,
      "blob_biases" : 113,
      "name" : "eye-out_convolution",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 6,
      "bottom" : "eye-decoder_concatenate_0_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 115
    }
  ]
}