{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "pad_r" : 2,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_0",
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "122",
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "Conv_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 2,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "input",
      "weights" : {

      },
      "Nx" : 6,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 6,
      "n_parallel" : 1,
      "blob_weights_f16" : 3
    },
    {
      "bottom" : "122",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_1",
      "top" : "123",
      "type" : "activation",
      "name" : "Sigmoid_1"
    },
    {
      "bottom" : "122,123",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_2",
      "top" : "124",
      "type" : "elementwise",
      "name" : "Mul_2",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_3",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "125",
      "K" : 16,
      "blob_biases" : 5,
      "stride_x" : 2,
      "name" : "Conv_3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "124",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 7
    },
    {
      "bottom" : "125",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_4",
      "top" : "126",
      "type" : "activation",
      "name" : "Sigmoid_4"
    },
    {
      "bottom" : "125,126",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_5",
      "top" : "127",
      "type" : "elementwise",
      "name" : "Mul_5",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_6",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "128",
      "K" : 32,
      "blob_biases" : 9,
      "name" : "Conv_6",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "127",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 11
    },
    {
      "bottom" : "128",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_7",
      "top" : "129",
      "type" : "activation",
      "name" : "Sigmoid_7"
    },
    {
      "bottom" : "128,129",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_8",
      "top" : "130",
      "type" : "elementwise",
      "name" : "Mul_8",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_9",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "131",
      "K" : 16,
      "blob_biases" : 13,
      "name" : "Conv_9",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "130",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 15
    },
    {
      "bottom" : "131",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_10",
      "top" : "132",
      "type" : "activation",
      "name" : "Sigmoid_10"
    },
    {
      "bottom" : "131,132",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_11",
      "top" : "133",
      "type" : "elementwise",
      "name" : "Mul_11",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_12",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "134",
      "K" : 16,
      "blob_biases" : 17,
      "name" : "Conv_12",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "133",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 19
    },
    {
      "bottom" : "134",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_13",
      "top" : "135",
      "type" : "activation",
      "name" : "Sigmoid_13"
    },
    {
      "bottom" : "134,135",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_14",
      "top" : "136",
      "type" : "elementwise",
      "name" : "Mul_14",
      "beta" : 0
    },
    {
      "bottom" : "130,136",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Add_15",
      "top" : "137",
      "type" : "elementwise",
      "name" : "Add_15",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_16",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "138",
      "K" : 32,
      "blob_biases" : 21,
      "name" : "Conv_16",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "127",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 23
    },
    {
      "bottom" : "138",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_17",
      "top" : "139",
      "type" : "activation",
      "name" : "Sigmoid_17"
    },
    {
      "bottom" : "138,139",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_18",
      "top" : "140",
      "type" : "elementwise",
      "name" : "Mul_18",
      "beta" : 0
    },
    {
      "weights" : {

      },
      "debug_info" : "Concat_19",
      "top" : "141",
      "type" : "concat",
      "name" : "Concat_19",
      "bottom" : "137,140"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_20",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "142",
      "K" : 32,
      "blob_biases" : 25,
      "name" : "Conv_20",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "141",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 27
    },
    {
      "bottom" : "142",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_21",
      "top" : "143",
      "type" : "activation",
      "name" : "Sigmoid_21"
    },
    {
      "bottom" : "142,143",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_22",
      "top" : "144",
      "type" : "elementwise",
      "name" : "Mul_22",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_23",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "145",
      "K" : 32,
      "blob_biases" : 29,
      "stride_x" : 2,
      "name" : "Conv_23",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "144",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 31
    },
    {
      "bottom" : "145",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_24",
      "top" : "146",
      "type" : "activation",
      "name" : "Sigmoid_24"
    },
    {
      "bottom" : "145,146",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_25",
      "top" : "147",
      "type" : "elementwise",
      "name" : "Mul_25",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_26",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "148",
      "K" : 64,
      "blob_biases" : 33,
      "name" : "Conv_26",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "147",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 35
    },
    {
      "bottom" : "148",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_27",
      "top" : "149",
      "type" : "activation",
      "name" : "Sigmoid_27"
    },
    {
      "bottom" : "148,149",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_28",
      "top" : "150",
      "type" : "elementwise",
      "name" : "Mul_28",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_29",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "151",
      "K" : 32,
      "blob_biases" : 37,
      "name" : "Conv_29",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "150",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 39
    },
    {
      "bottom" : "151",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_30",
      "top" : "152",
      "type" : "activation",
      "name" : "Sigmoid_30"
    },
    {
      "bottom" : "151,152",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_31",
      "top" : "153",
      "type" : "elementwise",
      "name" : "Mul_31",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_32",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "154",
      "K" : 32,
      "blob_biases" : 41,
      "name" : "Conv_32",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "153",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 43
    },
    {
      "bottom" : "154",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_33",
      "top" : "155",
      "type" : "activation",
      "name" : "Sigmoid_33"
    },
    {
      "bottom" : "154,155",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_34",
      "top" : "156",
      "type" : "elementwise",
      "name" : "Mul_34",
      "beta" : 0
    },
    {
      "bottom" : "150,156",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Add_35",
      "top" : "157",
      "type" : "elementwise",
      "name" : "Add_35",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_36",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "158",
      "K" : 32,
      "blob_biases" : 45,
      "name" : "Conv_36",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "157",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 47
    },
    {
      "bottom" : "158",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_37",
      "top" : "159",
      "type" : "activation",
      "name" : "Sigmoid_37"
    },
    {
      "bottom" : "158,159",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_38",
      "top" : "160",
      "type" : "elementwise",
      "name" : "Mul_38",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_39",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "161",
      "K" : 32,
      "blob_biases" : 49,
      "name" : "Conv_39",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "160",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 51
    },
    {
      "bottom" : "161",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_40",
      "top" : "162",
      "type" : "activation",
      "name" : "Sigmoid_40"
    },
    {
      "bottom" : "161,162",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_41",
      "top" : "163",
      "type" : "elementwise",
      "name" : "Mul_41",
      "beta" : 0
    },
    {
      "bottom" : "157,163",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Add_42",
      "top" : "164",
      "type" : "elementwise",
      "name" : "Add_42",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_43",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "165",
      "K" : 64,
      "blob_biases" : 53,
      "name" : "Conv_43",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "147",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 55
    },
    {
      "bottom" : "165",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_44",
      "top" : "166",
      "type" : "activation",
      "name" : "Sigmoid_44"
    },
    {
      "bottom" : "165,166",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_45",
      "top" : "167",
      "type" : "elementwise",
      "name" : "Mul_45",
      "beta" : 0
    },
    {
      "weights" : {

      },
      "debug_info" : "Concat_46",
      "top" : "168",
      "type" : "concat",
      "name" : "Concat_46",
      "bottom" : "164,167"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_47",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "169",
      "K" : 64,
      "blob_biases" : 57,
      "name" : "Conv_47",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "168",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 59
    },
    {
      "bottom" : "169",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_48",
      "top" : "170",
      "type" : "activation",
      "name" : "Sigmoid_48"
    },
    {
      "bottom" : "169,170",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_49",
      "top" : "171",
      "type" : "elementwise",
      "name" : "Mul_49",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_50",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "172",
      "K" : 64,
      "blob_biases" : 61,
      "stride_x" : 2,
      "name" : "Conv_50",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "171",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 63
    },
    {
      "bottom" : "172",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_51",
      "top" : "173",
      "type" : "activation",
      "name" : "Sigmoid_51"
    },
    {
      "bottom" : "172,173",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_52",
      "top" : "174",
      "type" : "elementwise",
      "name" : "Mul_52",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_53",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "175",
      "K" : 128,
      "blob_biases" : 65,
      "name" : "Conv_53",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "174",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 67
    },
    {
      "bottom" : "175",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_54",
      "top" : "176",
      "type" : "activation",
      "name" : "Sigmoid_54"
    },
    {
      "bottom" : "175,176",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_55",
      "top" : "177",
      "type" : "elementwise",
      "name" : "Mul_55",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_56",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "178",
      "K" : 64,
      "blob_biases" : 69,
      "name" : "Conv_56",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "177",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 71
    },
    {
      "bottom" : "178",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_57",
      "top" : "179",
      "type" : "activation",
      "name" : "Sigmoid_57"
    },
    {
      "bottom" : "178,179",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_58",
      "top" : "180",
      "type" : "elementwise",
      "name" : "Mul_58",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_59",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "181",
      "K" : 64,
      "blob_biases" : 73,
      "name" : "Conv_59",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "180",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 75
    },
    {
      "bottom" : "181",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_60",
      "top" : "182",
      "type" : "activation",
      "name" : "Sigmoid_60"
    },
    {
      "bottom" : "181,182",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_61",
      "top" : "183",
      "type" : "elementwise",
      "name" : "Mul_61",
      "beta" : 0
    },
    {
      "bottom" : "177,183",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Add_62",
      "top" : "184",
      "type" : "elementwise",
      "name" : "Add_62",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_63",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "185",
      "K" : 64,
      "blob_biases" : 77,
      "name" : "Conv_63",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "184",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 79
    },
    {
      "bottom" : "185",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_64",
      "top" : "186",
      "type" : "activation",
      "name" : "Sigmoid_64"
    },
    {
      "bottom" : "185,186",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_65",
      "top" : "187",
      "type" : "elementwise",
      "name" : "Mul_65",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_66",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "188",
      "K" : 64,
      "blob_biases" : 81,
      "name" : "Conv_66",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "187",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 83
    },
    {
      "bottom" : "188",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_67",
      "top" : "189",
      "type" : "activation",
      "name" : "Sigmoid_67"
    },
    {
      "bottom" : "188,189",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_68",
      "top" : "190",
      "type" : "elementwise",
      "name" : "Mul_68",
      "beta" : 0
    },
    {
      "bottom" : "184,190",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Add_69",
      "top" : "191",
      "type" : "elementwise",
      "name" : "Add_69",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_70",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "192",
      "K" : 64,
      "blob_biases" : 85,
      "name" : "Conv_70",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "191",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 87
    },
    {
      "bottom" : "192",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_71",
      "top" : "193",
      "type" : "activation",
      "name" : "Sigmoid_71"
    },
    {
      "bottom" : "192,193",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_72",
      "top" : "194",
      "type" : "elementwise",
      "name" : "Mul_72",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_73",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "195",
      "K" : 64,
      "blob_biases" : 89,
      "name" : "Conv_73",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "194",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 91
    },
    {
      "bottom" : "195",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_74",
      "top" : "196",
      "type" : "activation",
      "name" : "Sigmoid_74"
    },
    {
      "bottom" : "195,196",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_75",
      "top" : "197",
      "type" : "elementwise",
      "name" : "Mul_75",
      "beta" : 0
    },
    {
      "bottom" : "191,197",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Add_76",
      "top" : "198",
      "type" : "elementwise",
      "name" : "Add_76",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_77",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "199",
      "K" : 128,
      "blob_biases" : 93,
      "name" : "Conv_77",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "174",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 95
    },
    {
      "bottom" : "199",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_78",
      "top" : "200",
      "type" : "activation",
      "name" : "Sigmoid_78"
    },
    {
      "bottom" : "199,200",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_79",
      "top" : "201",
      "type" : "elementwise",
      "name" : "Mul_79",
      "beta" : 0
    },
    {
      "weights" : {

      },
      "debug_info" : "Concat_80",
      "top" : "202",
      "type" : "concat",
      "name" : "Concat_80",
      "bottom" : "198,201"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_81",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "203",
      "K" : 128,
      "blob_biases" : 97,
      "name" : "Conv_81",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "202",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 99
    },
    {
      "bottom" : "203",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_82",
      "top" : "204",
      "type" : "activation",
      "name" : "Sigmoid_82"
    },
    {
      "bottom" : "203,204",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_83",
      "top" : "205",
      "type" : "elementwise",
      "name" : "Mul_83",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_84",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "206",
      "K" : 128,
      "blob_biases" : 101,
      "stride_x" : 2,
      "name" : "Conv_84",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "205",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 103
    },
    {
      "bottom" : "206",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_85",
      "top" : "207",
      "type" : "activation",
      "name" : "Sigmoid_85"
    },
    {
      "bottom" : "206,207",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_86",
      "top" : "208",
      "type" : "elementwise",
      "name" : "Mul_86",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_87",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "209",
      "K" : 256,
      "blob_biases" : 105,
      "name" : "Conv_87",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "208",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 107
    },
    {
      "bottom" : "209",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_88",
      "top" : "210",
      "type" : "activation",
      "name" : "Sigmoid_88"
    },
    {
      "bottom" : "209,210",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_89",
      "top" : "211",
      "type" : "elementwise",
      "name" : "Mul_89",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_90",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "212",
      "K" : 128,
      "blob_biases" : 109,
      "name" : "Conv_90",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "211",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 111
    },
    {
      "bottom" : "212",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_91",
      "top" : "213",
      "type" : "activation",
      "name" : "Sigmoid_91"
    },
    {
      "bottom" : "212,213",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_92",
      "top" : "214",
      "type" : "elementwise",
      "name" : "Mul_92",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_93",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "215",
      "K" : 128,
      "blob_biases" : 113,
      "name" : "Conv_93",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "214",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 115
    },
    {
      "bottom" : "215",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_94",
      "top" : "216",
      "type" : "activation",
      "name" : "Sigmoid_94"
    },
    {
      "bottom" : "215,216",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_95",
      "top" : "217",
      "type" : "elementwise",
      "name" : "Mul_95",
      "beta" : 0
    },
    {
      "bottom" : "211,217",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Add_96",
      "top" : "218",
      "type" : "elementwise",
      "name" : "Add_96",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_97",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "219",
      "K" : 256,
      "blob_biases" : 117,
      "name" : "Conv_97",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "208",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 119
    },
    {
      "bottom" : "219",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_98",
      "top" : "220",
      "type" : "activation",
      "name" : "Sigmoid_98"
    },
    {
      "bottom" : "219,220",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_99",
      "top" : "221",
      "type" : "elementwise",
      "name" : "Mul_99",
      "beta" : 0
    },
    {
      "weights" : {

      },
      "debug_info" : "Concat_100",
      "top" : "222",
      "type" : "concat",
      "name" : "Concat_100",
      "bottom" : "218,221"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_101",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "223",
      "K" : 256,
      "blob_biases" : 121,
      "name" : "Conv_101",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "222",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 123
    },
    {
      "bottom" : "223",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_102",
      "top" : "224",
      "type" : "activation",
      "name" : "Sigmoid_102"
    },
    {
      "bottom" : "223,224",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_103",
      "top" : "225",
      "type" : "elementwise",
      "name" : "Mul_103",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_104",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "226",
      "K" : 256,
      "blob_biases" : 125,
      "name" : "Conv_104",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "225",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 127
    },
    {
      "bottom" : "226",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_105",
      "top" : "227",
      "type" : "activation",
      "name" : "Sigmoid_105"
    },
    {
      "bottom" : "226,227",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_106",
      "top" : "228",
      "type" : "elementwise",
      "name" : "Mul_106",
      "beta" : 0
    },
    {
      "pad_r" : 2,
      "debug_info" : "MaxPool_107",
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "size_x" : 5,
      "top" : "229",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "MaxPool_107",
      "pad_t" : 2,
      "stride_y" : 1,
      "bottom" : "228",
      "weights" : {

      },
      "pad_mode" : 0,
      "size_y" : 5,
      "pad_value" : 0
    },
    {
      "pad_r" : 2,
      "debug_info" : "MaxPool_108",
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "size_x" : 5,
      "top" : "230",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "MaxPool_108",
      "pad_t" : 2,
      "stride_y" : 1,
      "bottom" : "229",
      "weights" : {

      },
      "pad_mode" : 0,
      "size_y" : 5,
      "pad_value" : 0
    },
    {
      "pad_r" : 2,
      "debug_info" : "MaxPool_109",
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "size_x" : 5,
      "top" : "231",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "MaxPool_109",
      "pad_t" : 2,
      "stride_y" : 1,
      "bottom" : "230",
      "weights" : {

      },
      "pad_mode" : 0,
      "size_y" : 5,
      "pad_value" : 0
    },
    {
      "weights" : {

      },
      "debug_info" : "Concat_110",
      "top" : "232",
      "type" : "concat",
      "name" : "Concat_110",
      "bottom" : "228,229,230,231"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_111",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "233",
      "K" : 512,
      "blob_biases" : 129,
      "name" : "Conv_111",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "232",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 131
    },
    {
      "bottom" : "233",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_112",
      "top" : "234",
      "type" : "activation",
      "name" : "Sigmoid_112"
    },
    {
      "bottom" : "233,234",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_113",
      "top" : "235",
      "type" : "elementwise",
      "name" : "Mul_113",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_114",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "236",
      "K" : 256,
      "blob_biases" : 133,
      "name" : "Conv_114",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "235",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 135
    },
    {
      "bottom" : "236",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_115",
      "top" : "237",
      "type" : "activation",
      "name" : "Sigmoid_115"
    },
    {
      "bottom" : "236,237",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_116",
      "top" : "238",
      "type" : "elementwise",
      "name" : "Mul_116",
      "beta" : 0
    },
    {
      "top" : "242",
      "use_fractional_scale_factors" : false,
      "weights" : {

      },
      "fractional_scaling_factor_y" : 1,
      "type" : "upsample",
      "scaling_factor_x" : 2,
      "mode" : 0,
      "align_corners" : 0,
      "bottom" : "238",
      "debug_info" : "Upsample_117",
      "fractional_scaling_factor_x" : 1,
      "is_legacy_mode" : 1,
      "name" : "Upsample_117",
      "scaling_factor_y" : 2
    },
    {
      "weights" : {

      },
      "debug_info" : "Concat_118",
      "top" : "243",
      "type" : "concat",
      "name" : "Concat_118",
      "bottom" : "242,205"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_119",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "244",
      "K" : 256,
      "blob_biases" : 137,
      "name" : "Conv_119",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "243",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 139
    },
    {
      "bottom" : "244",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_120",
      "top" : "245",
      "type" : "activation",
      "name" : "Sigmoid_120"
    },
    {
      "bottom" : "244,245",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_121",
      "top" : "246",
      "type" : "elementwise",
      "name" : "Mul_121",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_122",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "247",
      "K" : 64,
      "blob_biases" : 141,
      "name" : "Conv_122",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "246",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 143
    },
    {
      "bottom" : "247",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_123",
      "top" : "248",
      "type" : "activation",
      "name" : "Sigmoid_123"
    },
    {
      "bottom" : "247,248",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_124",
      "top" : "249",
      "type" : "elementwise",
      "name" : "Mul_124",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_125",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "250",
      "K" : 64,
      "blob_biases" : 145,
      "name" : "Conv_125",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "249",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 147
    },
    {
      "bottom" : "250",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_126",
      "top" : "251",
      "type" : "activation",
      "name" : "Sigmoid_126"
    },
    {
      "bottom" : "250,251",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_127",
      "top" : "252",
      "type" : "elementwise",
      "name" : "Mul_127",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_128",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "253",
      "K" : 256,
      "blob_biases" : 149,
      "name" : "Conv_128",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "243",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 151
    },
    {
      "bottom" : "253",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_129",
      "top" : "254",
      "type" : "activation",
      "name" : "Sigmoid_129"
    },
    {
      "bottom" : "253,254",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_130",
      "top" : "255",
      "type" : "elementwise",
      "name" : "Mul_130",
      "beta" : 0
    },
    {
      "weights" : {

      },
      "debug_info" : "Concat_131",
      "top" : "256",
      "type" : "concat",
      "name" : "Concat_131",
      "bottom" : "252,255"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_132",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "257",
      "K" : 128,
      "blob_biases" : 153,
      "name" : "Conv_132",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "256",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 155
    },
    {
      "bottom" : "257",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_133",
      "top" : "258",
      "type" : "activation",
      "name" : "Sigmoid_133"
    },
    {
      "bottom" : "257,258",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_134",
      "top" : "259",
      "type" : "elementwise",
      "name" : "Mul_134",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_135",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "260",
      "K" : 128,
      "blob_biases" : 157,
      "name" : "Conv_135",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "259",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 159
    },
    {
      "bottom" : "260",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_136",
      "top" : "261",
      "type" : "activation",
      "name" : "Sigmoid_136"
    },
    {
      "bottom" : "260,261",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_137",
      "top" : "262",
      "type" : "elementwise",
      "name" : "Mul_137",
      "beta" : 0
    },
    {
      "top" : "266",
      "use_fractional_scale_factors" : false,
      "weights" : {

      },
      "fractional_scaling_factor_y" : 1,
      "type" : "upsample",
      "scaling_factor_x" : 2,
      "mode" : 0,
      "align_corners" : 0,
      "bottom" : "262",
      "debug_info" : "Upsample_138",
      "fractional_scaling_factor_x" : 1,
      "is_legacy_mode" : 1,
      "name" : "Upsample_138",
      "scaling_factor_y" : 2
    },
    {
      "weights" : {

      },
      "debug_info" : "Concat_139",
      "top" : "267",
      "type" : "concat",
      "name" : "Concat_139",
      "bottom" : "266,171"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_140",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "268",
      "K" : 128,
      "blob_biases" : 161,
      "name" : "Conv_140",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "267",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 163
    },
    {
      "bottom" : "268",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_141",
      "top" : "269",
      "type" : "activation",
      "name" : "Sigmoid_141"
    },
    {
      "bottom" : "268,269",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul_142",
      "top" : "270",
      "type" : "elementwise",
      "name" : "Mul_142",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Conv_143",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "271",
      "K" : 32,
      "blob_biases" : 165,
      "name" : "Conv_143",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "270",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 167
    },
    {
      "bottom" : "271",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "Sigmoid_144",
      "top" : "272",
      "type" : "activation",
      "name" : "Sigmoid_144"
    },
    {
      "bottom" : "271,272",
